Sure! @arybolovlev 

Terraform v1.2.7
Helm Provider 2.10.0
Kubernetes 1.24

When I run my argocd module with the helm provider 2.9.0 and no other changes I see this in my plan
We have an perpetual /infinite diff because of the credentials/secrets set unfortunately
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
      ~ values                     = [
          - (sensitive),
          + (sensitive),
        ]
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
When I just switch the provider to 2.10.0, I see tons of changes on all the helm releases we have in this module, here is just a snippet as its like hundreds of lines
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
      ~ metadata                   = [
          - {
              - app_version = "v2.8.4"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 99
              - values      = jsonencode(
ACTUALLY PRINTS SECRETS OUT IN PLAINTEXT HERE
.........
                )
              - version     = "5.46.8"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          - (sensitive),
          + (sensitive),
        ]
        # (26 unchanged attributes hidden)
    }
..........
  # helm_release.dex-pdb must be replaced
-/+ resource "helm_release" "dex-pdb" {
      ~ id                         = "dex-pdb" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = ""
              - chart       = "pod-disruption-budget"
              - name        = "dex-pdb"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - matchLabels         = {
                          - "app.kubernetes.io/component" = "dex-server"
                          - "app.kubernetes.io/name"      = "argocd-dex-server"
                        }
                      - name                = "dex-pdb"
                      - podDisruptionBudget = {
                          - minAvailable = 1
                        }
                    }
                )
              - version     = "1.0.0"
            },
        ] -> (known after apply)
        name                       = "dex-pdb"
      ~ namespace                  = "argocd" -> (known after apply) # forces replacement
        # (25 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.
```

The actual module code for like the helm release dex-pdb looks like this
```
resource "helm_release" "dex-pdb" {
  depends_on = [
    helm_release.argocd
  ]
  create_namespace = false
  chart            = "../common-helm-charts/pod-disruption-budget"
  name             = "dex-pdb"
  version          = local.pdb_chart_version
  namespace        = helm_release.argocd.metadata.0.namespace
  values = [
    yamlencode(local.chart_variables_dex-pdb)
  ]
}
```
It is just using a simple helm chart to install a PDB, nothing fancy, but I think it may be changing because it uses the argocd output as a dependency and that is changing so it might be forcing this to change

The argocd helm release looks like this 
```
resource "helm_release" "argocd" {

  name             = "argocd"
  create_namespace = true
  repository       = "https://argoproj.github.io/argo-helm"
  chart            = "argo-cd"
  version          = var.argocd_version
  namespace        = var.namespace
  values = [
    yamlencode(local.chart_variables)
  ]
}
```
Its using argos helm chart passing in all the values overrides we do, some have secret values in them

I also just tried this on another module we have for another helm release and it does not show anything destructive, but that one doesn't use secrets, maybe it has to do with this sensitive data stuff perhaps?

I am really scratching my head, happy to provide more things if you need it let me know